---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementLogicalFilter
source: html/4a1c004e-44dc-1810-f8df-6fc8f0d671b2.htm
---
# ElementLogicalFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.